#################################################################################  BY LEEKMAY ##########################################################################################################
SUPPORTER = 'litedex_support' # ник саппорта
SUPPORTER2 = 'СКОРО' # ник саппорта 2

BOT_TOKEN = '1338300520:AAHjl-Q8cxwEHXQ0DqD8eJEQZOPr0PSPXLE'      # Токен бота

CODE_ACCESS = 'TEST'    # код по которому можно будет давать доступ в итоге код получится TESTГОД-МЕСЯЦ-ЧИСЛО (TEST2020-01-01)

BOT_LOGIN = 'LiteDexBot'          # login бота, например: telegram_bot

ADMIN_ID = 1015165825       # id админа

QIWI_NUMBER = '+79001244142'    # номер киви
QIWI_TOKEN = '3fa2b52889f4369f128168fd2e0c8933'     # токен киви

ACCESS_COST = 248           # стоимость доступа
MIN_PAYOUT = 100           # минимальная сумма для запроса на вывод денег

LVL0 = 0.5        
LVL1 = 17.5           
LVL2 = 52          



#################################################################################  BY LEEKMAY ##########################################################################################################

