import settings

#################################################################################  BY LEEKMAY ##########################################################################################################
info_access = f'⭐️ Уровень: **0**\n\n' \
             '💎 Сейчас вам доступно: + **0.5 ₽** за каждого реферала.\n\n' \
             '❗️Получи 1 уровень, чтобы открыть способность:\n  **+ 17.5 р** за реферала\n\n __Или__\n\n' \
             '❗️❗️Получи сразу 2 уровень, чтобы открыть способность:\n  **+ 52 р** за реферала' \
             
buy_access = f'✅ Чтобы получить **1-й** уровень, переведите 99 рублей на Qiwi-кошелек __{settings.QIWI_NUMBER}__ с комментарием: 5467326756 \n\n✅ Чтобы получить сразу **2-й** уровень, переведите 248 рублей на Qiwi-кошелек __{settings.QIWI_NUMBER}__ с комментарием: 1756574566'

support = 'Список действующих агентов **Тех.Поддержки** : \n\n 1. @agent - Offline❌\n\n2. @agent2 - Offline❌\n\nПисать по всем интересующим вопросам!' \            

start_menu = '**⭐Здравствуйте, {name}**\n\n' \
        '💸Заработай **0.5 р** за каждого реферала\n\n' \
        '__Повышай уровень в разделе "Прогресс", чтобы зарабатывать еще больше.__'


ref_page = '⭐Здравствуйте, {name}\n' \
           'Ваша персональная реферальная ссылка : {ref_url}' \


admin_menu = '⭐Здравствуйте, {name}\n' \
             'Вы находитесь в меню админа: '


profile = '📰 Профиль\n\n' \
          '⭐️ Уровень: **0**\n\n' \
          '💰 Баланс: **0 руб**\n\n' \
          '👤 Рефералы: **0**\n\n' \
          '⏰ Ожидают подтверждения: **0**\n\n' \
          '👥 Рефералы ваших рефералов: **0**\n\n' \
          '💸 Зарабатывай, просто приглашая друзей.\n\nТвоя ссылка для приглашения:\n\n https://t.me/namebot?start=r0117524653'

profiles = '📰 Прsdsdsdофиль\n\n' \
          'Ваше имя - {name}\n' \
          'Ваш id - {id}\n' \
          'Доступ - {access}'


access_no_info = '📋 **Правила проекта:** \n\n' \
                 '**•** Запрещается любого вида накрутка, буксы, а также использование нескольких аккаунтов\n\n' \
                 '**•** Минимальная сумма вывода: 100₽\n\n' \
                 '**•** Администрация оставляет за собой право заморозить баланс при наличии  **подозрений о накрутке** и недобросовестности.' \
                 
                 #### НЕ НУЖНОЕ ####
access_info = '❕ Информаци о пирамиде\n\n' \
                 '💥 Пирамида имеет 2-х уровневую систему\n' \
                 '💥 Оплачивая доступ вы получаете личную ссылку для приглашения пользователей\n' \
                 f'💥 За каждого пригл. пользователя который оплатил доступ вы получаете {settings.LVL1} % от оплаты\n' \
                 f'💥 За каждого пригл. им пользователя вы получаете {settings.LVL2} % от оплаты\n' \
                 f'💥 Далее {settings.LVL2} % от оплаты\n' \
                 f'💥 Пригласив всего 1 активного пользователя вы можете получить более 100 тысяч рублей!!'


access_yes_info = '⚠️ Информация\n\n' \
                  '❕ Ваш реф. код - {ref_code}\n' \
                  '❕ Ваша реф. ссылка - {ref_url}\n\n' \
                  '💰 Ваш заработок - {profit} руб\n' \
                  '👥 Кол-во приглашенных людей - {amount_invite_users}'






admin_profit = '💰 Прибыть за все время составила - {} рублей'


admin_info = 'Общая информация\n\n' \
             'Всего уникальных пользователей - {users}\n' \
             'Кол-во людей оплативших доступ - {deposit}\n'


order_payment = 'Запрос на вывод\n\n' \
                'ID запроса - {}\n' \
                'User_id - {}\n' \
                'Имя - {}\n' \
                'Сумма - {}\n' \
                'Дата - {}\n' \
                'QIWI - {}'


withdraw = '⚠️ Запрос выплаты\n\n' \
           '❕ Ваш баланс - {} руб\n' \
           f'❕ Мин. сумма выплаты - {settings.MIN_PAYOUT} руб\n\n' \
           '❕ Введите сумму которую хотите вывести: \n\n' \
           f'❗️ Например: 500 или 764.34'

#################################################################################  BY LEEKMAY ##########################################################################################################